{
  "blogs": [
    {
      "title": "Jon Snow",
      "imageUrl": "https://c4.wallpaperflare.com/wallpaper/252/308/961/game-of-thrones-jon-snow-4k-season-5-wallpaper-preview.jpg",
      "description": "Jon Snow, born Aegon Targaryen, is the son of Lyanna Stark and Rhaegar Targaryen, the late Prince of Dragonstone. From infancy, Jon is presented as the bastard son of Lord Eddard Stark, Lyanna's brother, and raised alongside Eddard's lawful children at Winterfell. Jon's true parentage is kept secret from everyone, including Jon himself, in order to protect him from those that sought the complete annihilation of House Targaryen.\n\nJon joins the Night's Watch and is later elected as Lord Commander. As a result of several controversial decisions, such as allowing the wildlings to settle south of the Wall, Jon is murdered in a mutiny, but is resurrected by Melisandre.\n\nFreed from his Night's Watch vows, Jon and his half-sister Sansa Stark retake Winterfell from House Bolton, restoring House Stark's dominion over the North. Jon is declared King in the North.\n\nJon negotiates with Daenerys Targaryen for an alliance against the White Walkers in the imminent Great War. Later he pledges himself and his army to Daenerys, whom he falls in love with, subsequently abdicating his throne and being named Warden of the North.[2]\n\nLater, Jon learns his true lineage from Samwell Tarly, revealing Daenerys is his aunt. A dragonrider whose dragon was Rhaegal, he fights in the Battle of Winterfell, during which the Night King is defeated and the return of the Long Night is prevented. Afterwards, Jon aids Daenerys in her resumed campaign to take the Iron Throne and participates in the Battle of King's Landing. However, when Daenerys lays waste to a surrendered King's Landing, Jon tries but is unable to dissuade her from more destruction and assassinates her to prevent further carnage.\n\nFollowing the Great Council of 305 AC, Jon is sent into exile, returning to the Night's Watch. He leads the remaining Free Folk to settle in the thawing free lands.",
      "id": 1
    },
    {
      "title": "Sansa Stark",
      "imageUrl": "https://c4.wallpaperflare.com/wallpaper/238/244/919/tv-show-game-of-thrones-sansa-stark-sophie-turner-hd-wallpaper-preview.jpg",
      "description": "Queen Sansa Stark is the eldest daughter of Lord Eddard Stark and his wife, Lady Catelyn, sister of Robb, Arya, Bran, and Rickon Stark, and \"half-sister\" of Jon Snow; though truthfully is his cousin.\n\nInitially betrothed to Prince Joffrey Baratheon, the heir to the Iron Throne, Sansa travels to King's Landing in preparation for her nuptials, but essentially becomes a hostage of House Lannister following the execution of her father on trumped-up charges of treason. Under the (sometimes unwitting) tutelage of Cersei Lannister, Margaery Tyrell, and Petyr Baelish, Sansa becomes well versed in politics and court intrigue, but suffers all the same.\n\nEven after escaping the capital and returning to her childhood home of Winterfell, she endures further hardship at the hands of House Bolton. After escaping from Winterfell with the help of her father's former ward, Theon Greyjoy, and her sworn-sword, Brienne of Tarth, Sansa reunites with Jon at Castle Black. Along with the support of the Free Folk, the knights of the Vale, and certain Northern houses, the two of them retake Winterfell from Ramsay Bolton, and Sansa becomes the Lady of Winterfell, whilst Jon is declared King in the North.\n\nDispleased at Jon for abdicating his title in favor of House Targaryen, she finds enmity with Queen Daenerys, who refuses to accept Northern independence in her restoration and quest for the Iron Throne. Following the Battle of King's Landing and Daenerys's subsequent assassination, Sansa declares the North an independent kingdom and is later crowned Queen in the North.",
      "id": 2
    }
  ]
}